export const SCORE_STRINGS = [
  '전혀 그렇지 않다',
  '그렇지 않은 편이다',
  '보통이다',
  '그런 편이다',
  '매우 그렇다'
];

export const TYPE_STRINGS = [
  'EMPTY',
  '자기 보고용',
  '타인 보고용'
];

export const INTRODUCTION = [
  '책 <a href="http://www.yes24.com/Product/Goods/9261020">H팩터의 심리학</a>에 소개된 HEXACO 성격 요인을 테스트 하는 봇입니다.',
  '',
  'H - 정직-겸손성(Honesty-Humility)',
  'E - 정서성(Emotionality)',
  'X - 외향성(eXtraversion)',
  'A - 원만성(Agreeableness)',
  'C - 성실성(Conscientiousness)',
  'O - 경험 개방성(Openness to Experience)',
];

export const DESCRIPTIONS = [
  [
    '*정직-겸손성*이 높은 사람은 타인을 이용하거나 착취하지 않습니다. 남보다 더 많이 차지하려는 탐욕이 적어서 무언가를 이루기 위해 타인을 이용할 동기가 애초부터 크지 않습니다. 도덕적 양심으로 인해 개인적인 이득을 볼 기회를 많이 놓칩니다.',
    '',
    '진실한, 정직한, 충실한, 충성적인, 겸손한, 가식적이지 않은, 공정한, 윤리적인 *vs* 교활한, 가식적인, 탐욕스러운, 젠체하는, 위선적인, 자랑하는, 자만심이 센, 자기중심적인'
  ],
  [
    '*정서성*은 자신과 가족의 생존 가능성을 높여주는 특성으로 이루어져 있습니다. 정서성이 높은 사람은 신체적 위험에 처하는 것에 무서움을 많이 느끼고 그 상황을 회피하려 합니다. 어떤 환경에서는 위험한 일을 감수해야만 자신이나 가족에게 보상을 줄 수 있는데, 이런 일을 지나치게 삼가면 그런 보상의 기회를 계속 놓치게 됩니다.',
    '',
    '감정적인, 여린, 센티멘털한, 겁이 많은, 걱정이 많은, 불안한, 의존적인, 상처받기 쉬운 *vs* 터프한, 겁 없는, 감정이 없는, 독립적인, 강인한, 용감한'
  ],
  [
    '*외향성*이 높은 사람은 다른 사람이 자신을 좋아한다고 가정합니다. 이들은 다른 사람을 이끌어나가고 자신의 주장을 펼치는 것을 아주 좋아합니다. 이들이 사회적 관심을 획득해가려 할 때 또 다른 외향적인 사람과 경쟁해야 하며 이는 때때로 적대적으로 전개되기도 합니다. 이런 적대적인 경쟁은 신체적 위해나 사회적 왕따를 초래할 수도 있습니다.',
    '',
    '활동적인, 쾌활한, 외향적인, 사회적인, 수다스러운, 명랑한, 적극적인, 자신감이 있는 *vs* 수줍은, 수동적인, 나서지 않는, 내성적인, 조용한, 말수가 적은, 침울한'
  ],
  [
    '*원만성*이 높은 사람은 타인이 완전히 호의적이거나 협력적이지 않아도 그 사람을 배척하지 않고 여전히 그에게 협동할 의향을 보입니다. 이러한 관용이 애초에 악의를 가진 사람들에게 적용될 때 지속적 착취 대상이 될 수 있습니다.',
    '',
    '참을성이 많은, 용인하는, 평화스러운, 온화한, 원만한, 관대한, 신사적인, 용서하는 *vs* 성마른, 싸움 좋아하는, 완고한, 화 잘 내는, 성질 있는, 고집 센, 퉁명스러운'
  ],
  [
    '*성실성*이 높은 사람은 시간 관리에 뛰어나고, 정리 정돈에 능하며, 일을 열심히 아주 오래 합니다. 이들은 재정적으로 더 견실하고 더 오래 살며 신체적으로 더 건강한 상태를 보인다고 알려져 있습니다. 성실성이 높은 데 필요한 에너지 비용은 개방성 요인에서 언급했던 비용보다 더 큽니다. 성실성의 주요 특징 중 하나인 계획을 세우거나 충동을 억제하는 활동도 뇌에 많은 에너지를 부과합니다.',
    '',
    '치밀한, 자기 규율적인, 부지런한, 효율적인, 신중한, 철저한, 정확한, 완벽주의적인 *vs* 대충대충 하는, 소홀한, 무모한, 게으른, 책임감이 없는, 잘 잊어버리는, 지저분한'
  ],
  [ 
    '*경험 개방성*이 높은 사람은 예술과 자연에 대한 감흥에 쉽게 빠져들고 인간과 자연 세계를 더 잘 이해하고 싶어 하는 열망이 강합니다. 개방성이 높은 활동을 할 때 생기는 문제는 물리적 위험이 수반된다는 점입니다. 또 끊임없이 생각하고 지적으로 몰두해 있으면 뇌는 더 많은 포도당을 소비합니다.',
    '',
    '지성적인, 창조적인, 비관습적인, 상상력이 풍부한, 혁신적인, 복잡한, 깊은, 탐구심이 풍부한, 철학적인 *vs* 깊이가 없는 단순한, 상상력이 부족한, 관습적인, 폐쇄적인'
  ],
  [ '연구 결과에 따르면 우리는 처음 만난 사람의 *외향성*에 대해서는 적어도 꽤 정확하게 판단할 수 있습니다. 상대방을 잘 모른다고 느끼는 쌍도 *외향성*이나 *정서성*에 대해서는 상당히 정확하게 판단하고 있었습니다. 그다지 잘 알지 못하는 사람, 즉 조금 먼 관계에 있는 사회 친구나 직장 동료라도 그들의 성격에 대해 그런대로 잘 판단할 수 있습니다. 그런데 *정직성*은 좀 다릅니다. *정직성*을 정확히 판단하려면 그 사람을 상당히 잘 알아야 합니다.' ],
  [
    '연구 결과에 따르면 연구 참여자들은 자신과 친숙한 사람이 지닌 HEXACO 성격 요인을 상당히 정확히 판단하고 있습니다. 자기 보고와 타인 보고의 일치도는 상관계수로 0.5 정도에 이르는 수준이었습니다. 이것은 꽤 높은 수준의 일치도를 나타내는 것입니다.',
    '',
    '우리는 친숙한 사람들의 성격을 꽤 정확하게 판단할 수 있습니다. 그리고 우리는 그다지 잘 알지 못하는 사람, 즉 조금 먼 관계에 있는 사회 친구나 직장 동료라도 그들의 성격에 대해 그런대로 잘 판단할 수 있습니다. 그런데 정직성은 좀 다릅니다. 정직성을 정확히 판단하려면 그 사람을 상당히 잘 알아야 합니다.',
    '',
    '다만 일치도 계수와 그 친구들이 알아왔던 시간에는 관련성이 거의 없었습니다. 1년 정도만 알았던 쌍이나 10년 넘게 알아왔던 쌍이나 자기 보고-타인 보고 일치도에는 거의 차이가 없었습니다. 다른 사람의 정직성을 정확히 알아내는 데에도 1년이면 충분합니다.'
  ],
  ['부부가 지닌 신념의 유사성은 연구 첫해에 측정했을 때나 17년 후에 측정했을 때나 차이가 거의 없었습니다. 결혼 생활을 통해 부부의 의견이 점점 수렴해갈 것이라는 가설은 지지되지 않았지요. 이 연구 결과는 비슷비슷한 신념을 가진 사람들이 애초에 부부로 만나게 되고, 부부가 정치적, 종교적 태도에서 유사성을 보이는 가장 중요한 이유라는 것을 나타냅니다.'],
  [
    '신체적 매력도처럼 모든 사람이 완전히 동의하는 "더 좋은" 방향이 없는 특성들은 어떤 방향이든 자신의 특성과 비슷할수록 선호하게 됩니다.',
    '',
    '두 친구의 성격 유사성을 나타내주는 상관성을 조사해봤습니다. *정직성*과 *개방성*에서 아주 일관되게 정적 상관이 나왔습니다. 그러나 나머지 4가지 요인에서는 상관이 거의 0에 가깝게 나왔습니다. 친구들의 성격은 *정직성*과 *개방성*에서 비슷한 편이고, 자기 자신들은 이 유사성을 더 과장해서 지각하는 경향이 있습니다. 사람의 가치관은 그들이 지닌 *정직성*과 *개방성*의 점수에 상당히 큰 영향을 받습니다. 가치관이 서로 유사한 사람들끼리 친구가 될 가능성이 더 높습니다.'
  ]
];
